#include <iostream>
#include "lib.h"

int main(){
    std::cout << "'1' - вызов функции подсчёта НОД для двух натуральных чисел." << "\n"
    << "'2' - вызов функции рассчета значения числа Пи при заданной длине ряда (K)." << "\n"
    << "'3' - окончание работы программы." << "\n" << "\n"
    << "Введите номер команды: ";

    int num;
    std::cin >> num;

    while (num != 3){
        switch (num){
            
            case 1:
                int A, B;
                std::cout << "Введите два натуральных числа: ";
                std::cin >> A >> B;

                std::cout << "НОД(" << A << "," << B << ") = " << GCF(A, B) << "\n" << "\n"
                << "Введите номер команды: ";
                std::cin >> num;
                break;

            case 2:
                int K;
                std::cout << "Введите длину ряда K: ";
                std::cin >> K;

                std::cout << "Число Пи при K = " << K << ": " << Pi(K) << "\n" << "\n"
                << "Введите номер команды: ";

                std::cin >> num;
                break;

            default:
                std::cout << "Команды с таким номером нет." << "\n";
                return -1;
        }
    }
    return 0;
}